---
kind: property
id: P:Autodesk.Revit.DB.PointClouds.PointIterator.CurrentObject
source: html/c0817b98-d5a3-2c5f-2016-befce6f7906e.htm
---
# Autodesk.Revit.DB.PointClouds.PointIterator.CurrentObject Property

## Syntax (C#)
```csharp
public Object CurrentObject { get; }
```